; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-11)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city7)
	(fuel-level plane1 fl5)
	(at plane2 city5)
	(fuel-level plane2 fl4)
	(at plane3 city3)
	(fuel-level plane3 fl3)
	(at plane4 city5)
	(fuel-level plane4 fl4)
	(at person1 city12)
	(at person2 city1)
	(at person3 city12)
	(at person4 city0)
	(at person5 city4)
	(at person6 city9)
	(at person7 city7)
	(at person8 city8)
	(at person9 city8)
	(at person10 city13)
	(at person11 city3)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city9)
	(at plane2 city0)
	(at plane3 city1)
	(at person1 city6)
	(at person2 city8)
	(at person3 city6)
	(at person4 city7)
	(at person5 city6)
	(at person6 city8)
	(at person7 city5)
	(at person8 city3)
	(at person9 city13)
	(at person10 city7)
	(at person11 city4)
	))

)

; plan
1. (fly plane4 city5 city0 fl4 fl3)
   deleted: (at plane4 city5) (fuel-level plane4 fl4)
   added: (at plane4 city0) (fuel-level plane4 fl3)
   goals met: 0 of 14
2. (board person4 plane4 city0)
   deleted: (at person4 city0)
   added: (in person4 plane4)
   goals met: 0 of 14
3. (zoom plane4 city0 city7 fl3 fl2 fl1)
   deleted: (at plane4 city0) (fuel-level plane4 fl3)
   added: (at plane4 city7) (fuel-level plane4 fl1)
   goals met: 0 of 14
4. (debark person4 plane4 city7)
   deleted: (in person4 plane4)
   added: (at person4 city7)
   goals met: 1 of 14
5. (zoom plane3 city3 city1 fl3 fl2 fl1)
   deleted: (at plane3 city3) (fuel-level plane3 fl3)
   added: (at plane3 city1) (fuel-level plane3 fl1)
   goals met: 2 of 14
6. (board person2 plane3 city1)
   deleted: (at person2 city1)
   added: (in person2 plane3)
   goals met: 2 of 14
7. (zoom plane2 city5 city0 fl4 fl3 fl2)
   deleted: (at plane2 city5) (fuel-level plane2 fl4)
   added: (at plane2 city0) (fuel-level plane2 fl2)
   goals met: 3 of 14
8. (zoom plane1 city7 city12 fl5 fl4 fl3)
   deleted: (at plane1 city7) (fuel-level plane1 fl5)
   added: (at plane1 city12) (fuel-level plane1 fl3)
   goals met: 3 of 14
9. (board person7 plane4 city7)
   deleted: (at person7 city7)
   added: (in person7 plane4)
   goals met: 3 of 14
10. (fly plane4 city7 city5 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 3 of 14
11. (debark person7 plane4 city5)
   deleted: (in person7 plane4)
   added: (at person7 city5)
   goals met: 4 of 14
12. (board person3 plane1 city12)
   deleted: (at person3 city12)
   added: (in person3 plane1)
   goals met: 4 of 14
13. (zoom plane1 city12 city8 fl3 fl2 fl1)
   deleted: (at plane1 city12) (fuel-level plane1 fl3)
   added: (at plane1 city8) (fuel-level plane1 fl1)
   goals met: 4 of 14
14. (board person9 plane1 city8)
   deleted: (at person9 city8)
   added: (in person9 plane1)
   goals met: 4 of 14
15. (board person8 plane1 city8)
   deleted: (at person8 city8)
   added: (in person8 plane1)
   goals met: 4 of 14
16. (fly plane3 city1 city8 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 3 of 14
17. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 14
18. (debark person2 plane3 city8)
   deleted: (in person2 plane3)
   added: (at person2 city8)
   goals met: 4 of 14
19. (fly plane3 city8 city1 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 5 of 14
20. (fly plane1 city8 city13 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city13) (fuel-level plane1 fl0)
   goals met: 5 of 14
21. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 5 of 14
22. (debark person9 plane1 city13)
   deleted: (in person9 plane1)
   added: (at person9 city13)
   goals met: 6 of 14
23. (board person10 plane1 city13)
   deleted: (at person10 city13)
   added: (in person10 plane1)
   goals met: 6 of 14
24. (fly plane1 city13 city3 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 6 of 14
25. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 14
26. (debark person8 plane1 city3)
   deleted: (in person8 plane1)
   added: (at person8 city3)
   goals met: 7 of 14
27. (board person11 plane1 city3)
   deleted: (at person11 city3)
   added: (in person11 plane1)
   goals met: 7 of 14
28. (fly plane1 city3 city4 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 7 of 14
29. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 14
30. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   goals met: 7 of 14
31. (debark person11 plane1 city4)
   deleted: (in person11 plane1)
   added: (at person11 city4)
   goals met: 8 of 14
32. (fly plane1 city4 city6 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 8 of 14
33. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 14
34. (debark person5 plane1 city6)
   deleted: (in person5 plane1)
   added: (at person5 city6)
   goals met: 9 of 14
35. (debark person3 plane1 city6)
   deleted: (in person3 plane1)
   added: (at person3 city6)
   goals met: 10 of 14
36. (fly plane1 city6 city7 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 10 of 14
37. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 14
38. (debark person10 plane1 city7)
   deleted: (in person10 plane1)
   added: (at person10 city7)
   goals met: 11 of 14
39. (fly plane1 city7 city9 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 12 of 14
40. (board person6 plane1 city9)
   deleted: (at person6 city9)
   added: (in person6 plane1)
   goals met: 12 of 14
41. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 14
42. (fly plane1 city9 city8 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 11 of 14
43. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 14
44. (debark person6 plane1 city8)
   deleted: (in person6 plane1)
   added: (at person6 city8)
   goals met: 12 of 14
45. (fly plane1 city8 city12 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city12) (fuel-level plane1 fl0)
   goals met: 12 of 14
46. (refuel plane1 city12 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 14
47. (board person1 plane1 city12)
   deleted: (at person1 city12)
   added: (in person1 plane1)
   goals met: 12 of 14
48. (fly plane1 city12 city6 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 12 of 14
49. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 14
50. (debark person1 plane1 city6)
   deleted: (in person1 plane1)
   added: (at person1 city6)
   goals met: 13 of 14
51. (fly plane1 city6 city9 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 14 of 14
